wosayttn/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
        for (i = 0; i < sizeof(pISPInfo->au32AESKey) / 4; i++)
            DBG("   0x%08x", pISPInfo->au32AESKey[i]);

        DBG("\nAES IV:\n");

        for (i = 0; i < sizeof(pISPInfo->au32AESIV) / 4; i++)
            DBG("   0x%08x", pISPInfo->au32AESIV[i]);

        DBG("\nRSP data(encryption?):\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif

    /* Generate CRC32 */
    _Perform_CRC32((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 4, 0);

    return 0;
}

static int32_t _Perform_ParsePacket(CMD_PACKET_T *pCMD)
{
    volatile int32_t    i;

#if (0)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("Raw REQ data:\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif

    /* verify CRC32 */
    if (_Perform_CRC32((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 4, 1) != 0)
    {
        DBG("\n\tPacket CRC32 mismatch!\n");
        return -1;
    }

    for (i = 0; i < sizeof(g_ChipISPInfo.au32AESKey) / 4; i++)
    {
        if (g_ChipISPInfo.au32AESKey[i] != 0x0ul)
            break;
    }

    /* if i == 8, NO AES key, do not decrypt the cmd data */
    if (i == 8)
    {
        DBG("\nDo not decrypt cmd data. \n");
    }
    else
    {
        if (_AES256Decrypt(pCMD->au32Data, pCMD->au32Data, sizeof(pCMD->au32Data), g_ChipISPInfo.au32AESKey, g_ChipISPInfo.au32AESIV) < 0)
        {
            return -1;
        }
    }

#if (0)
    {
        uint32_t *pu32;
        pu32 = (uint32_t *)pCMD;
        DBG("AES KEY:\n");

        for (i = 0; i < sizeof(g_ChipISPInfo.au32AESKey) / 4; i++)
            DBG("   0x%08x", g_ChipISPInfo.au32AESKey[i]);

        DBG("\nAES IV:\n");

        for (i = 0; i < sizeof(g_ChipISPInfo.au32AESIV) / 4; i++)
            DBG("   0x%08x", g_ChipISPInfo.au32AESIV[i]);

        DBG("\nREQ data(decryption?):\n");

        for (i = 0; i < 2; i++)
            DBG("   0x%08x", pu32[i]);

        for (i = 2; i < sizeof(CMD_PACKET_T) / 4; i++)
        {
            if ((i % 4) == 2)
                DBG("\n");

            DBG("   0x%08x", pu32[i]);
        }

        DBG("\n");
    }
#endif

    /* verify CCITT */
    if (_Perform_CCITT((uint32_t *)pCMD, sizeof(CMD_PACKET_T) - 8, 1) != 0)
    {
        DBG("\n\tPacket CCITT mismatch!\n");
        return -1;
    }

    DBG("Parse cmd PASS!\n\n");
    return 0;
}

/* Stage 1. */
static int32_t Process_Connect(void)
{
    uint32_t    i, u32PacketID = 0x48;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_CONNECT;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 0;

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if (g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    g_ChipISPInfo.u32PID        = g_ReturnData.au32Data[1];
    g_ChipISPInfo.au32AESIV[0]  = Swap32(g_ReturnData.au32Data[2]);
    g_ChipISPInfo.au32AESIV[1]  = Swap32(g_ReturnData.au32Data[3]);
    g_ChipISPInfo.au32AESIV[2]  = Swap32(g_ReturnData.au32Data[4]);
    g_ChipISPInfo.au32AESIV[3]  = Swap32(g_ReturnData.au32Data[5]);

    return 0;
}

/* ECC key pair */
char g_acPriv[] = "380a67fcfc01ca7073da7c2c54296a61327f77262a7d4674c3d8e29a63e3fa20";
char g_acPub0[] = "755b3819f05a3e9f32d4d599062834aac5220f75955378414a8f63716a152ce2";
char g_acPub1[] = "91c413f1915ed7b47473fd797647ba3d83e8224377909af5b30c530eaad79fd7";
static int32_t ECDH_0_SendPub0(void)
{
    uint32_t    i, u32PacketID = 0xE0;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_PUB0;
    g_WriteCmd.u16PacketID  = u32PacketID;
    memcpy(&g_WriteCmd.au32Data[0], g_ChipISPInfo.ServerPubKey.au32Key0, sizeof(g_ChipISPInfo.ServerPubKey.au32Key0));

    for (i = 0; i < 8; i++)
        DBG("Out pub0[%d]: 0x%08x.\n", i, g_WriteCmd.au32Data[i]);

    g_WriteCmd.u16Len       = sizeof(g_ChipISPInfo.ServerPubKey.au32Key0);

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if (g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    return 0;
}

/* The ECC public key pair of USB client, e.g SecureISPDemo */
char g_acClientPub0[] = "d32438a1b4428541c564eeed79669b4bd3bf601c758469545e013c8fe8af7ef6";
char g_acClientPub1[] = "476de8f3c6e6c48a8bacf1e1827cfb82501833c2bb816344f996533b1b031706";
static int32_t ECDH_1_SendPub1(void)
{
    uint32_t    i, u32PacketID = 0xE1;
    uint32_t    tmp[8];

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_PUB1;
    g_WriteCmd.u16PacketID  = u32PacketID;
    memcpy(&g_WriteCmd.au32Data[0], g_ChipISPInfo.ServerPubKey.au32Key1, sizeof(g_ChipISPInfo.ServerPubKey.au32Key1));

