wosayttn/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
    /* Generate public */
    if (ECC_GeneratePublicKey(CRYPTO, CURVE_P_256, g_ChipISPInfo.d, g_ChipISPInfo.Qx, g_ChipISPInfo.Qy) < 0)
    {
        printf("ECC key generation failed!!\n");

        while (1) {}
    }

    DBG("Public Qx is  %s\n", g_ChipISPInfo.Qx);
    DBG("Public Qy is  %s\n", g_ChipISPInfo.Qy);
    DBG("\n");

    Hex2Reg((char *)g_ChipISPInfo.Qx, g_ChipISPInfo.ServerPubKey.au32Key0);
    Hex2Reg((char *)g_ChipISPInfo.Qy, g_ChipISPInfo.ServerPubKey.au32Key1);
    BytesSwap((char *)g_ChipISPInfo.ServerPubKey.au32Key0, sizeof(g_ChipISPInfo.ServerPubKey.au32Key0));
    BytesSwap((char *)g_ChipISPInfo.ServerPubKey.au32Key1, sizeof(g_ChipISPInfo.ServerPubKey.au32Key1));
}

static int32_t ECDH_4_SendRandPub0(void)
{
    uint32_t    i, u32PacketID = 0xE4;

    Generate_RandECCKey();

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_RAND_PUB0;
    g_WriteCmd.u16PacketID  = u32PacketID;
    memcpy(&g_WriteCmd.au32Data[0], g_ChipISPInfo.ServerPubKey.au32Key0, sizeof(g_ChipISPInfo.ServerPubKey.au32Key0));

    for (i = 0; i < 8; i++)
        DBG("Out pub0[%d]: 0x%08x.\n", i, g_WriteCmd.au32Data[i]);

    g_WriteCmd.u16Len       = sizeof(g_ChipISPInfo.ServerPubKey.au32Key0);

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if (g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    return 0;
}

static int32_t ECDH_5_SendRandPub1(void)
{
    uint32_t    i, u32PacketID = 0xE5;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_RAND_PUB1;
    g_WriteCmd.u16PacketID  = u32PacketID;
    memcpy(&g_WriteCmd.au32Data[0], g_ChipISPInfo.ServerPubKey.au32Key1, sizeof(g_ChipISPInfo.ServerPubKey.au32Key1));

    for (i = 0; i < 8; i++)
        DBG("Out pub0[%d]: 0x%08x.\n", i, g_WriteCmd.au32Data[i]);

    g_WriteCmd.u16Len       = sizeof(g_ChipISPInfo.ServerPubKey.au32Key1);

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if (g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    return 0;
}

static int32_t ECDH_6_GetRandPub0(void)
{
    uint32_t    i, u32PacketID = 0xE6;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_GET_RAND_PUB0;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 0;

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if (g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    memcpy(g_ChipISPInfo.ClientPubKey.au32Key0, (char *)(&g_ReturnData.au32Data[1]), sizeof(g_ChipISPInfo.ClientPubKey.au32Key0));

    return 0;
}

static int32_t ECDH_7_GetRandPub1(void)
{
    uint32_t    i, u32PacketID = 0xE7;
    uint32_t    tmp[8];

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_GET_RAND_PUB1;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 0;

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if (g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];



    /* Generate 2nd ECDH key */
    memcpy(g_ChipISPInfo.ClientPubKey.au32Key1, (char *)(&g_ReturnData.au32Data[1]), sizeof(g_ChipISPInfo.ClientPubKey.au32Key1));

    memset(g_ChipISPInfo.Qx,   0x0, sizeof(g_ChipISPInfo.Qx));
    memset(g_ChipISPInfo.Qy,   0x0, sizeof(g_ChipISPInfo.Qy));

    /* Set Qx */
    memcpy(tmp, (char *)g_ChipISPInfo.ClientPubKey.au32Key0, sizeof(tmp));
    BytesSwap((char *)tmp, sizeof(tmp));
    Reg2Hex(64, tmp, g_ChipISPInfo.Qx);

    /* Set Qy */
    memcpy(tmp, (char *)g_ChipISPInfo.ClientPubKey.au32Key1, sizeof(tmp));
    BytesSwap((char *)tmp, sizeof(tmp));
    Reg2Hex(64, tmp, g_ChipISPInfo.Qy);

