wosayttn/M55M1BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
    return 0;
}

static int32_t Process_VendorFunc(uint32_t *pu32Buf)
{
    uint32_t    i, u32PacketID = 0x99;

    if (pu32Buf[0] > 44)
        return -1; // valid data length can not large than 44 bytes

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_VENDOR_FUNC;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.au32Data[0]  = 0x0; // RESERVED

    /* Valid input data starting from g_WriteCmd.au32Data[1] */
    switch (pu32Buf[1])
    {
        case 0x1000:    // get ID via vendor command
        case 0x2000:    // read flash via vendor command
        case 0x3000:    // write flash via vendor command
            for (i = 0; i < (pu32Buf[0] / 4); i++)
                g_WriteCmd.au32Data[1 + i] = pu32Buf[1 + i];

            g_WriteCmd.u16Len = 4 + pu32Buf[0];
            break;

        default:
            DBG("\n[Invalid sub command] (L:%d)\n", __LINE__);
            return 0;
    }

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    /*
        Valid output data starting from g_ReturnData.au32Data[1]
        g_ReturnData.au32Data[1]  : byte counts
        g_ReturnData.au32Data[2~] : data buffer
    */
    switch (pu32Buf[1])
    {
        case 0x1000:    // get ID via vendor command
        case 0x2000:    // read flash data ID via vendor command
            for (i = 0; i < (g_ReturnData.au32Data[1] / 4); i++)
                printf("0x%08x, ", g_ReturnData.au32Data[2 + i]);

            printf("\n");
            break;

        case 0x3000:    // write flash via vendor command
            break;
    }

    return 0;
}

static int32_t Process_ReSyncDevice(void)
{
    uint32_t    i, u32PacketID = 0x31;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_RESYNC;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 4;
    g_WriteCmd.au32Data[0]  = 0; // CHIP reset

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while (g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if (_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if (g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    return 0;
}

static int32_t Process_ResetDevice(void)
{
    uint32_t    i, u32PacketID = 0x31;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_RESET;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 4;
    g_WriteCmd.au32Data[0]  = 0; // CHIP reset

    if (_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);

    if (usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    return 0;
}

int32_t Process_USBHCommand(HID_DEV_T *hdev)
{
    volatile uint32_t   i, j;
    uint32_t            u32Item;

    /* Unlock protected registers */
    SYS_UnlockReg();

    /* Install USBH read function */
    if (usbh_hid_start_int_read(hdev, 0, int_read_callback) != HID_RET_OK)
    {
        printf("[FAIL] ==> Interrupt in transfer started...\n");

        while (1) {}
    }

    g_pHDEV = hdev;

    printf("\n\n****************************************\n\n");

    printf("Click any key to connect with SecureISP client. 'r' to reset Server.\n\n");

    if (My_GetChar() == 'r')
    {
        SYS_ResetChip();
    }

    Process_ReSyncDevice();
    delay_us(500000);


    /* Enable CRYPTO clock */
    CLK_EnableModuleClock(CRYPTO0_MODULE);

    ECC_ENABLE_INT(CRYPTO);

    NVIC_EnableIRQ(CRYPTO_IRQn);

    /* Initial Random Number Generator */
    RNG_Open();


    memset(&g_ChipISPInfo, 0x0, sizeof(CHIP_ISP_INFO_T));

    /* Step 1. Wait connect command successfully */
    while (1)
    {
        printf("[Process connect ...]\n\n");

        if (Process_Connect() == 0)
            break;

        My_GetChar();
    }

    /* Step 2. Wait ECDH successfully */
    printf("[Processing ECDH key exchange ...]\n\n");

    if (Process_ECDH() != 0)
        while (1) {}


    /* Step 3. To process commands */
    while (1)
    {
        printf("\n");
        printf("=============================\n");
        printf("   [ 0] Get ID\n");
        printf("   [ 1] Erase flash - from 0x10000 to 0x11000\n");
        printf("   [ 2] Write flash - from 0x10000 to 0x11000\n");
        printf("        * Should be perform erase command before writing flash\n");
        printf("   [ 3] Vendor function - read ID\n");
        printf("   [ 4] Vendor function - read flash from 0x10000 to 0x11000\n");
        printf("   [ 5] Vendor function - write flash from 0x10000 to 0x11000\n");
        printf("        * Should be perform erase command before writing flash\n");
        printf("=============================\n");
        printf("   [90] Reset device\n");
        printf("=============================\n");

        u32Item = sysGetNum();
        printf("[Select: %d]\n\n", u32Item);

